server/tests/load/spike-test.yml
# ──────────────────────────────────────────────────────────
# TMS v2 — Spike Test (Artillery)
# ──────────────────────────────────────────────────────────
# Simulates a sudden traffic spike to test system resilience
# and rate limiter behavior under extreme conditions.
# Run:  npx artillery run tests/load/spike-test.yml
# ──────────────────────────────────────────────────────────

config:
  target: "http://localhost:5000"
  phases:
    # Normal load: 5 users/sec for 20 seconds
    - duration: 20
      arrivalRate: 5
      name: "Normal Load"
    # SPIKE: Jump to 100 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 100
      name: "⚡ Traffic Spike"
    # Recovery: Drop back to 5 users/sec for 20 seconds
    - duration: 20
      arrivalRate: 5
      name: "Recovery"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    expect: {}

scenarios:
  - name: "Spike: Health Check Flood"
    weight: 5
    flow:
      - get:
          url: "/api/health"

  - name: "Spike: Login Brute Force (should be rate-limited)"
    weight: 3
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "FAKE001"
            password: "wrongpassword1"
          # We EXPECT 401 or 429 (rate limited) — both are acceptable
          expect:
            - statusCode:
              - 401
              - 429

  - name: "Spike: Read Authenticated Data"
    weight: 2
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "000001"
            password: "admin12345!"
      - get:
          url: "/api/classes"
      - get:
          url: "/api/users?page=1&limit=50"
      - get:
          url: "/api/dashboard/stats"